Revit 2027 API
ParameterTypeId.MepSegmentFamilyname Property
 "Family Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepSegmentFamilyname { get; }
Public Shared ReadOnly Property MepSegmentFamilyname As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepSegmentFamilyname {
	ForgeTypeId^ get ();
}
static member MepSegmentFamilyname : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace